doc/02-arquitetura/sequencia/02-criar-produto.puml
@startuml
title Criar Produto

actor Usuario
participant ProdutoController
participant ProdutoMapper
participant ProdutoServiceImpl
participant ProdutoRepository
participant "Banco H2" as H2

Usuario -> ProdutoController : POST /produtos\nProdutoRequest
ProdutoController -> ProdutoMapper : toEntity(request)
ProdutoMapper --> ProdutoController : Produto
ProdutoController -> ProdutoServiceImpl : salvar(produto)
ProdutoServiceImpl -> ProdutoRepository : save(produto)
ProdutoRepository -> H2 : INSERT produto
H2 --> ProdutoRepository : produto persistido
ProdutoRepository --> ProdutoServiceImpl : Produto
ProdutoServiceImpl --> ProdutoController : Produto
ProdutoController -> ProdutoMapper : toResponse(produto)
ProdutoMapper --> ProdutoController : ProdutoResponse + links
ProdutoController --> Usuario : 201 Created\nLocation + payload HAL

@enduml
